ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/uart.h
#define UART_TNCR_TXNCTR(value) ((UART_TNCR_TXNCTR_Msk & ((value) << UART_TNCR_TXNCTR_Pos)))
/* -------- UART_PTCR : (UART Offset: 0x120) Transfer Control Register -------- */
#define UART_PTCR_RXTEN (0x1u << 0) /**< \brief (UART_PTCR) Receiver Transfer Enable */
#define UART_PTCR_RXTDIS (0x1u << 1) /**< \brief (UART_PTCR) Receiver Transfer Disable */
#define UART_PTCR_TXTEN (0x1u << 8) /**< \brief (UART_PTCR) Transmitter Transfer Enable */
#define UART_PTCR_TXTDIS (0x1u << 9) /**< \brief (UART_PTCR) Transmitter Transfer Disable */
#define UART_PTCR_RXCBEN (0x1u << 16) /**< \brief (UART_PTCR) Receiver Circular Buffer Enable */
#define UART_PTCR_RXCBDIS (0x1u << 17) /**< \brief (UART_PTCR) Receiver Circular Buffer Disable */
#define UART_PTCR_TXCBEN (0x1u << 18) /**< \brief (UART_PTCR) Transmitter Circular Buffer Enable */
#define UART_PTCR_TXCBDIS (0x1u << 19) /**< \brief (UART_PTCR) Transmitter Circular Buffer Disable */
#define UART_PTCR_ERRCLR (0x1u << 24) /**< \brief (UART_PTCR) Transfer Bus Error Clear */
/* -------- UART_PTSR : (UART Offset: 0x124) Transfer Status Register -------- */
#define UART_PTSR_RXTEN (0x1u << 0) /**< \brief (UART_PTSR) Receiver Transfer Enable */
#define UART_PTSR_TXTEN (0x1u << 8) /**< \brief (UART_PTSR) Transmitter Transfer Enable */
#define UART_PTSR_RXCBEN (0x1u << 16) /**< \brief (UART_PTSR) Receiver Circular Buffer Enable */
#define UART_PTSR_TXCBEN (0x1u << 18) /**< \brief (UART_PTSR) Transmitter Circular Buffer Enable */
#define UART_PTSR_ERR (0x1u << 24) /**< \brief (UART_PTSR) Transfer Bus Error */
/* -------- UART_PWPMR : (UART Offset: 0x128) Write Protection Mode Register -------- */
#define UART_PWPMR_WPPTREN (0x1u << 0) /**< \brief (UART_PWPMR) Write Protection Pointer Registers Enable */
#define UART_PWPMR_WPCTREN (0x1u << 1) /**< \brief (UART_PWPMR) Write Protection Counter Registers Enable */
#define UART_PWPMR_WPCREN (0x1u << 2) /**< \brief (UART_PWPMR) Write Protection Control Register Enable */
#define UART_PWPMR_WPKEY_Pos 8
#define UART_PWPMR_WPKEY_Msk (0xffffffu << UART_PWPMR_WPKEY_Pos) /**< \brief (UART_PWPMR) Write Protection Key */
#define UART_PWPMR_WPKEY(value) ((UART_PWPMR_WPKEY_Msk & ((value) << UART_PWPMR_WPKEY_Pos)))
#define   UART_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (UART_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_UART_COMPONENT_ */
